# Binaries
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'z'

# Development
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bettertouchtool'
cask 'calibre'
cask 'docker'
cask 'dropbox'
cask 'finicky'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iterm2'
cask 'macdown'
cask 'microsoft-teams'
cask 'phpstorm'
cask 'plex'
cask 'screenflow'
cask 'sequel-ace'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'textexpander'
cask 'the-unarchiver'
cask 'transmit'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Deliveries', id: 290986013
mas 'Harvest', id: 506189836
mas 'Hidden Bar', id: 1452453066
mas 'Keynote', id: 409183694
mas 'Things', id: 904280696
mas 'LiveReload', id: 482898991
