# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wp-cli'
brew 'z'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'affinity-photo'
cask 'alfred'
cask 'bettertouchtool'
cask 'calibre'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-drive'
cask 'imazing'
cask 'iterm2'
cask 'macdown'
cask 'microsoft-teams'
cask 'phpstorm'
cask 'plex'
cask 'screenflow'
cask 'slack'
cask 'sequel-ace'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'wireguard'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Calca', id: 635758264
mas 'Harvest', id: 506189836
mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Parcel', id: 639968404
mas 'Things', id: 904280696
mas 'Telegram', id: 747648890
mas 'WireGuard', id: 1451685025
