tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"

brew "bat"
brew "coreutils"
brew "curl"
brew "dnsmasq"
brew "eza"
brew "fzf"
brew "git"
brew "gnupg"
brew "grep"
brew "lazygit"
brew "lsd"
brew "mas"
brew "neovim"
brew "nvm"
brew "pkg-config"
brew "pure"
brew "rsync"
brew "starship"
brew "stow"
brew "tmux"
brew "tpm"
brew "zellij"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alacritty"
cask "alfred"
cask "bettertouchtool"
cask "bruno"
cask "daisydisk"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "keymapp"
cask "logitech-g-hub"
cask "microsoft-teams"
cask "obsidian"
cask "phpstorm"
cask "setapp"
cask "sequel-ace"
cask "slack"
cask "synology-drive"
cask "telegram"
cask "transmit"
cask "ubersicht"

# Mac App Store
mas "Calca", id: 635758264
mas "Harvest", id: 506189836
mas "Microsoft Remote Desktop", id: 1295203466
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "WireGuard", id: 1451685025
